Revit 2026 API

# TableSectionData Properties

---

The TableSectionData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FirstColumnNumber | The first column in this section of the table. |
|  | FirstRowNumber | The first row in this section of the table. |
|  | HideSection | Whether or not the section is hidden. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LastColumnNumber | The last column in this section of the table. |
|  | LastRowNumber | The last row in this section of the table. |
|  | NeedsRefresh | Indicates if the table data need to refresh. |
|  | NumberOfColumns | Gets or sets the number of items in column data array. |
|  | NumberOfRows | Gets or sets the number of items in row data array. |

#### Reference

TableSectionData Class

Autodesk.Revit.DB Namespace